app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "gaurav"], ["body", "java spring boot"], ["post_id", 4], ["created_at", "2023-03-09 05:42:20.127810"], ["updated_at", "2023-03-09 05:42:20.127810"]]
---
  def create
    @post = Post.friendly.find(params[:post_id])
    @comment = @post.comments.create(comment_params)